{
  "backend/main.mo": "Defines an e-commerce backend canister with authorization, product management, user profiles, and order handling using Maps for storage.",
  "feature_evidence.json": "Lists features, related files, components, and test IDs for the project’s product, cart, checkout, and order functionality.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all frontend files describing their responsibilities and functionality.",
  "frontend/index.css": "Tailwind CSS config defining global theme variables, light/dark mode tokens, and base styles.",
  "frontend/index.html": "Base HTML template that loads the React app root and main entry script.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, global layout, auth-guarded routes, and admin pages for the frontend.",
  "frontend/src/cart/CartContext.tsx": "Implements React cart state with add, update, remove, totals, and localStorage persistence.",
  "frontend/src/cart/cartStorage.ts": "Provides load/save/clear cart helpers with BigInt-safe serialization to localStorage.",
  "frontend/src/components/Auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with query cache clearing and error handling.",
  "frontend/src/components/Auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without a profile to enter and save their name.",
  "frontend/src/components/Auth/RequireAdmin.tsx": "Wrapper that restricts content to admins, showing a loader or access denied message.",
  "frontend/src/components/Auth/RequireAuth.tsx": "Enforces authentication, displaying a login prompt when no identity is present.",
  "frontend/src/components/CartLineItem.tsx": "Displays a cart item with image, price, quantity controls, and remove option.",
  "frontend/src/components/HeaderNav.tsx": "Top navigation bar with links, cart icon, login, and mobile menu; adds admin link if applicable.",
  "frontend/src/components/ProductCard.tsx": "Product display card linking to product details, showing image, price, and availability.",
  "frontend/src/components/QuantityPicker.tsx": "Numeric quantity selector with increment/decrement buttons and input validation.",
  "frontend/src/components/SearchBar.tsx": "Search input with icon for filtering products by text.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAdminProducts.ts": "Mutations for creating, updating, and toggling availability of products, invalidating product queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Query and mutation hooks for products, search, orders, and customer order retrieval using the actor.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and update the caller's user profile using react-query and an actor API.",
  "frontend/src/hooks/useUserRole.ts": "Defines hooks to get the caller’s user role and admin status through actor-based react-query calls.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines light/dark mode CSS variables for theme colors.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminProductEditorPage.tsx": "Provides a form to create or edit products, loading existing data when editing and submitting changes through admin API hooks.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Shows an admin product list with controls to add, edit, and toggle availability, including loading skeletons and status indicators.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items, allows quantity updates and item removal, and provides a checkout summary.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements the checkout form, creates an order on submit, and redirects to confirmation.",
  "frontend/src/pages/MyOrdersPage.tsx": "Fetches and lists the user’s past orders with loading and empty states.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows confirmation details for a placed order, including item breakdown and totals.",
  "frontend/src/pages/OrderDetailsPage.tsx": "Displays detailed information for a specific order, including items, totals, and timestamps.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays individual product details, handles loading and not-found states, and allows adding available products to the cart with quantity selection.",
  "frontend/src/pages/ProductsPage.tsx": "Lists all available products with search filtering, showing skeletons while loading and a hero banner at the top.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Defines the project’s current e-commerce build state, listing implemented features, image requirements, and metadata. Includes versioning and a partially shown new feature request list."
}